---
type: SubTransaction
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# SubTransaction

`Autodesk.Revit.DB.SubTransaction` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SubTransaction | 2011 | `public SubTransaction ( Document document )` |
| Method | Commit | 2011 | `public TransactionStatus Commit ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetStatus | 2011 | `public TransactionStatus GetStatus ()` |
| Method | HasEnded | 2011 | `public bool HasEnded ()` |
| Method | HasStarted | 2011 | `public bool HasStarted ()` |
| Method | RollBack | 2011 | `public TransactionStatus RollBack ()` |
| Method | Start | 2011 | `public TransactionStatus Start ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |